Materials/NMTFD2/Ex02/3D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 -0.0127)//0
	(0 0.0127 -0.0127)//1
	(0 0.1143 -0.0127)//2
	(0.508 0.1143 -0.0127)//3
	(0.508 0.0127 -0.0127)//4
	(0.508 0 -0.0127)//5
	(-0.254 0.1143 -0.0127)//6
	(-0.254 0.0127 -0.0127)//7
	(0 0 0.0127)//8
	(0 0.0127 0.0127)//9
	(0 0.1143 0.0127)//10
	(0.508 0.1143 0.0127)//11
	(0.508 0.0127 0.0127)//12
	(0.508 0 0.0127)//13
	(-0.254 0.1143 0.0127)//14
	(-0.254 0.0127 0.0127)//15	
);

blocks
(
    hex (7 1 2 6 15 9 10 14) (60 150 10) simpleGrading (0.1 10 1)//1block
    hex (1 4 3 2 9 12 11 10) (400 150 10) simpleGrading (1 10 1)//2block
    hex (0 5 4 1 8 13 12 9) (400 30 10)  simpleGrading (1 10 1)//3block
)

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 15 14 6)         
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 12 11 3)
            (5 13 12 4)
         );
    }
    upperWall
    {
        type wall;
        faces
        (
            (10 14 6 2)
            (11 10 2 3)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (9 15 7 1)
	     
        );
    }
	stepWall
    {
        type wall;
        faces
        (
            (0 8 9 1)
	     
        );
    }
	bottomWall
    {
        type wall;
        faces
        (
            (13 8 0 5)
	     
        );
    }
    

    frontAndBack
    {
        type wall;
        faces
        (
            (1 2 6 7)
	     (9 10 14 15)
            (4 3 2 1)
	     (12 11 10 9)
	     (5 4 1 0)
             (13 12 9 8)
        );
    }

	
  );

mergePatchPairs
(
);

// ************************************************************************* //
