Materials/NMTFD2/Ex02/3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 7.25662244;

boundaryField
{
    inlet
    {
        type            fixedValue;
	  value           uniform 7.25662244;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           uniform 7.25662244;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 7.25662244;
    }
	stepWall
    {
        type            kqRWallFunction;
        value           uniform 7.25662244;
    }
    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 7.25662244;
    }
    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 7.25662244;
    }
}


// ************************************************************************* //
